Repository: it-room/itrblueboost
Catalog: translations/*/ModulesItrblueboostAdmin.*.xlf
Languages: fr_fr

# mod.itrblueboost.itroomApiIntegration
source: ITROOM API Integration
fr_fr: Intégration API ITROOM

# mod.itrblueboost.integrationModuleDescription
source: Integration module with ITROOM API for data synchronization.
fr_fr: Module d'intégration avec l'API ITROOM pour la synchronisation des données.

# mod.itrblueboost.confirmUninstall
source: Are you sure you want to uninstall this module?
fr_fr: Êtes-vous sûr de vouloir désinstaller ce module ?

# mod.itrblueboost.itroomApiConfiguration
source: ITROOM API Configuration
fr_fr: Configuration API ITROOM

# mod.itrblueboost.configSaved
source: Configuration saved successfully.
fr_fr: Configuration enregistrée avec succès.

# mod.itrblueboost.compatibility
source: Compatibility
fr_fr: Compatibilité

# mod.itrblueboost.compatibilitySettings
source: Compatibility Settings
fr_fr: Paramètres de compatibilité

# mod.itrblueboost.bootstrapVersion
source: Bootstrap version
fr_fr: Version de Bootstrap

# mod.itrblueboost.selectBootstrapVersion
source: Select the Bootstrap version used on your theme.
fr_fr: Sélectionnez la version de Bootstrap utilisée par votre thème.

# mod.itrblueboost.apiMode
source: API mode
fr_fr: Mode API

# mod.itrblueboost.selectApiEnvironment
source: Select the API environment. Use Production by default.
fr_fr: Sélectionnez l'environnement API. Utilisez Production par défaut.

# mod.itrblueboost.tips
source: Tips
fr_fr: Conseils

# mod.itrblueboost.productFaq
source: Product FAQ
fr_fr: FAQ Produit

# mod.itrblueboost.categoryFaq
source: Category FAQ
fr_fr: FAQ Catégorie

# mod.itrblueboost.productContent
source: Product Content
fr_fr: Contenu Produit

# mod.itrblueboost.aiProductImages
source: AI Product Images
fr_fr: Images IA Produit

# mod.itrblueboost.generatedFaqs
source: Generated FAQs
fr_fr: FAQ générées

# mod.itrblueboost.generatedImages
source: Generated Images
fr_fr: Images générées

# mod.itrblueboost.allProductFaqs
source: All Product FAQs
fr_fr: Toutes les FAQ Produit

# mod.itrblueboost.allCategoryFaqs
source: All Category FAQs
fr_fr: Toutes les FAQ Catégorie

# mod.itrblueboost.allProductContents
source: All Product Contents
fr_fr: Tous les contenus Produit

# mod.itrblueboost.apiLogs
source: API Logs
fr_fr: Logs API

# mod.itrblueboost.apiLogDetails
source: API Log Details
fr_fr: Détails du log API

# mod.itrblueboost.addFaq
source: Add FAQ
fr_fr: Ajouter une FAQ

# mod.itrblueboost.editFaq
source: Edit FAQ
fr_fr: Modifier la FAQ

# mod.itrblueboost.faqCreated
source: FAQ created successfully.
fr_fr: FAQ créée avec succès.

# mod.itrblueboost.faqUpdated
source: FAQ updated.
fr_fr: FAQ mise à jour.

# mod.itrblueboost.faqDeleted
source: FAQ deleted.
fr_fr: FAQ supprimée.

# mod.itrblueboost.faqNotFound
source: FAQ not found.
fr_fr: FAQ introuvable.

# mod.itrblueboost.noFaqSelected
source: No FAQ selected.
fr_fr: Aucune FAQ sélectionnée.

# mod.itrblueboost.errorCreatingFaq
source: Error creating FAQ.
fr_fr: Erreur lors de la création de la FAQ.

# mod.itrblueboost.errorUpdatingFaq
source: Error updating FAQ.
fr_fr: Erreur lors de la mise à jour de la FAQ.

# mod.itrblueboost.errorDeletingFaq
source: Error deleting FAQ.
fr_fr: Erreur lors de la suppression de la FAQ.

# mod.itrblueboost.faqsAccepted
source: %d FAQs accepted.
fr_fr: %d FAQ acceptées.

# mod.itrblueboost.faqsRejected
source: %d FAQs rejected.
fr_fr: %d FAQ rejetées.

# mod.itrblueboost.deleteFaqConfirm
source: Delete this FAQ?
fr_fr: Supprimer cette FAQ ?

# mod.itrblueboost.deleteFaqAction
source: Are you sure you want to delete this FAQ?
fr_fr: Êtes-vous sûr de vouloir supprimer cette FAQ ?

# mod.itrblueboost.permanentlyDeleteFaq
source: This action will permanently delete this FAQ.
fr_fr: Cette action supprimera définitivement cette FAQ.

# mod.itrblueboost.deleteSelectedFaqs
source: Delete selected FAQs?
fr_fr: Supprimer les FAQ sélectionnées ?

# mod.itrblueboost.noFaqForProduct
source: No FAQ for this product.
fr_fr: Aucune FAQ pour ce produit.

# mod.itrblueboost.noFaqForCategory
source: No FAQ for this category.
fr_fr: Aucune FAQ pour cette catégorie.

# mod.itrblueboost.noFaqsGenerated
source: No FAQs generated yet
fr_fr: Aucune FAQ générée pour le moment

# mod.itrblueboost.noProductFaqsGenerated
source: No product FAQs generated yet
fr_fr: Aucune FAQ produit générée pour le moment

# mod.itrblueboost.noCategoryFaqsGenerated
source: No category FAQs generated yet
fr_fr: Aucune FAQ catégorie générée pour le moment

# mod.itrblueboost.generatedFaqsAppear
source: Generated FAQs will appear here.
fr_fr: Les FAQ générées apparaîtront ici.

# mod.itrblueboost.answer
source: Answer
fr_fr: Réponse

# mod.itrblueboost.questionAnswer
source: Question / Answer
fr_fr: Question / Réponse

# mod.itrblueboost.noAnswer
source: No answer
fr_fr: Pas de réponse

# mod.itrblueboost.active
source: Active
fr_fr: Actif

# mod.itrblueboost.modificationReason
source: Modification reason
fr_fr: Raison de la modification

# mod.itrblueboost.modificationReasonRequired
source: Modification reason is required when content is changed.
fr_fr: La raison de la modification est obligatoire car vous avez modifié le contenu.

# mod.itrblueboost.explainModificationContent
source: Explain why you are modifying this content (optional)
fr_fr: Expliquez pourquoi vous modifiez ce contenu (optionnel)

# mod.itrblueboost.explainModificationContentDots
source: Explain why you are modifying this content...
fr_fr: Expliquez pourquoi vous modifiez ce contenu...

# mod.itrblueboost.infoSentToApi
source: This information will be sent to the API for traceability.
fr_fr: Cette information sera envoyée à l'API pour traçabilité.

# mod.itrblueboost.requiredIfModified
source: Required if you modify the content. This information will be sent to the API.
fr_fr: Obligatoire si vous modifiez le contenu. Cette information sera envoyée à l'API.

# mod.itrblueboost.thisReasonSentToApi
source: This reason will be sent to the API.
fr_fr: Cette raison sera envoyée à l'API.

# mod.itrblueboost.editContent
source: Edit Content
fr_fr: Modifier le contenu

# mod.itrblueboost.contentUpdated
source: Content updated.
fr_fr: Contenu mis à jour.

# mod.itrblueboost.contentDeleted
source: Content deleted.
fr_fr: Contenu supprimé.

# mod.itrblueboost.contentNotFound
source: Content not found.
fr_fr: Contenu introuvable.

# mod.itrblueboost.errorUpdatingContent
source: Error updating content.
fr_fr: Erreur lors de la mise à jour du contenu.

# mod.itrblueboost.errorDeletingContent
source: Error deleting content.
fr_fr: Erreur lors de la suppression du contenu.

# mod.itrblueboost.contentRequired
source: Content is required.
fr_fr: Le contenu est obligatoire.

# mod.itrblueboost.deleteContentConfirm
source: Delete this content?
fr_fr: Supprimer ce contenu ?

# mod.itrblueboost.permanentlyDeleteContent
source: This action will permanently delete this content.
fr_fr: Cette action supprimera définitivement ce contenu.

# mod.itrblueboost.deleteContentAction
source: Are you sure you want to delete this content?
fr_fr: Êtes-vous sûr de vouloir supprimer ce contenu ?

# mod.itrblueboost.deleteSelectedContents
source: Delete selected contents?
fr_fr: Supprimer les contenus sélectionnés ?

# mod.itrblueboost.noContentForProduct
source: No generated content for this product.
fr_fr: Aucun contenu généré pour ce produit.

# mod.itrblueboost.noProductContentsGenerated
source: No product contents generated yet
fr_fr: Aucun contenu produit généré pour le moment

# mod.itrblueboost.generatedContentsAppear
source: Generated contents will appear here.
fr_fr: Les contenus générés apparaîtront ici.

# mod.itrblueboost.contentPendingApproval
source: Content pending approval
fr_fr: Contenu en attente d'approbation

# mod.itrblueboost.contentMustBeAccepted
source: This content must be accepted to be applied to the product.
fr_fr: Ce contenu doit être accepté pour être appliqué au produit.

# mod.itrblueboost.reviewContent
source: Review the generated content before accepting.
fr_fr: Vérifiez le contenu généré avant de l'accepter.

# mod.itrblueboost.editContentHtml
source: Edit the AI-generated content. You can use HTML formatting.
fr_fr: Modifiez le contenu généré par l'IA. Vous pouvez utiliser la mise en forme HTML.

# mod.itrblueboost.canEditBeforeAccepting
source: You can edit the content before accepting.
fr_fr: Vous pouvez modifier le contenu avant de l'accepter.

# mod.itrblueboost.acceptingWillUpdateDesc
source: Accepting will update the product description.
fr_fr: L'acceptation mettra à jour la description du produit.

# mod.itrblueboost.content
source: Content
fr_fr: Contenu

# mod.itrblueboost.generatedContent
source: Generated content
fr_fr: Contenu généré

# mod.itrblueboost.contentType
source: Content type
fr_fr: Type de contenu

# mod.itrblueboost.contentTypeColon
source: Content type:
fr_fr: Type de contenu :

# mod.itrblueboost.shortDescription
source: Short description
fr_fr: Description courte

# mod.itrblueboost.shortDesc
source: Short desc.
fr_fr: Desc. courte

# mod.itrblueboost.selectContentType
source: Select whether this is for the main description or short description.
fr_fr: Sélectionnez s'il s'agit de la description principale ou de la description courte.

# mod.itrblueboost.markActive
source: Mark this content as active
fr_fr: Marquer ce contenu comme actif

# mod.itrblueboost.aiImagesPrefix
source: AI Images -
fr_fr: Images IA -

# mod.itrblueboost.productNotFound
source: Product not found.
fr_fr: Produit introuvable.

# mod.itrblueboost.noImagesGenerated
source: No images generated yet
fr_fr: Aucune image générée pour le moment

# mod.itrblueboost.generatedImagesAppear
source: Generated images will appear here.
fr_fr: Les images générées apparaîtront ici.

# mod.itrblueboost.pendingImages
source: Pending images
fr_fr: Images en attente

# mod.itrblueboost.acceptedImages
source: Accepted images
fr_fr: Images acceptées

# mod.itrblueboost.noPendingImages
source: No pending images.
fr_fr: Aucune image en attente.

# mod.itrblueboost.noAcceptedImages
source: No accepted images.
fr_fr: Aucune image acceptée.

# mod.itrblueboost.acceptedImagesInfo
source: Accepted images will appear here and in the product gallery.
fr_fr: Les images acceptées apparaîtront ici et dans la galerie du produit.

# mod.itrblueboost.clickGenerateImage
source: Click "Generate Image (AI)" to create a new image.
fr_fr: Cliquez sur « Générer une image (IA) » pour créer une nouvelle image.

# mod.itrblueboost.permanentlyDeleteImage
source: Permanently delete this image?
fr_fr: Supprimer définitivement cette image ?

# mod.itrblueboost.baseImageOptional
source: Base image (optional):
fr_fr: Image de base (optionnel) :

# mod.itrblueboost.selectBaseImage
source: Select an existing image for the AI to use as inspiration.
fr_fr: Sélectionnez une image existante comme source d'inspiration pour l'IA.

# mod.itrblueboost.none
source: None
fr_fr: Aucune

# mod.itrblueboost.generate
source: Generate
fr_fr: Générer

# mod.itrblueboost.generateFaqAi
source: Generate FAQ (AI)
fr_fr: Générer FAQ (IA)

# mod.itrblueboost.generateFaqWithAi
source: Generate FAQ with AI
fr_fr: Générer FAQ avec l'IA

# mod.itrblueboost.generateContentAi
source: Generate Content (AI)
fr_fr: Générer contenu (IA)

# mod.itrblueboost.generateContentWithAi
source: Generate Content with AI
fr_fr: Générer du contenu avec l'IA

# mod.itrblueboost.generateContentWithAiLower
source: Generate content with AI
fr_fr: Générer du contenu avec l'IA

# mod.itrblueboost.generateImageAi
source: Generate Image (AI)
fr_fr: Générer image (IA)

# mod.itrblueboost.generateImagesAi
source: Generate Images (AI)
fr_fr: Générer images (IA)

# mod.itrblueboost.generateImageWithAi
source: Generate an image with AI
fr_fr: Générer une image avec l'IA

# mod.itrblueboost.generation
source: Generation
fr_fr: Génération

# mod.itrblueboost.generationStyle
source: Generation style:
fr_fr: Style de génération :

# mod.itrblueboost.chooseStyle
source: Choose a style
fr_fr: Choisir un style

# mod.itrblueboost.initializing
source: Initializing...
fr_fr: Initialisation...

# mod.itrblueboost.done
source: Done
fr_fr: Terminé

# mod.itrblueboost.selectPromptFaq
source: Select a prompt to generate FAQs:
fr_fr: Sélectionnez un prompt pour générer les FAQ :

# mod.itrblueboost.selectPromptContent
source: Select a prompt to generate content:
fr_fr: Sélectionnez un prompt pour générer le contenu :

# mod.itrblueboost.selectPrompt
source: Select a prompt:
fr_fr: Sélectionnez un prompt :

# mod.itrblueboost.choosePrompt
source: Choose a prompt
fr_fr: Choisir un prompt

# mod.itrblueboost.loadingPrompts
source: Loading available prompts...
fr_fr: Chargement des prompts disponibles...

# mod.itrblueboost.selected
source: selected
fr_fr: sélectionné(s)

# mod.itrblueboost.includingWithFaqs
source: including %count% with generated FAQs
fr_fr: dont %count% avec des FAQs générées

# mod.itrblueboost.includingWithImages
source: including %count% with generated images
fr_fr: dont %count% avec des images générées

# mod.itrblueboost.insufficientCredits
source: Insufficient credits. Please recharge your credits to use AI generation.
fr_fr: Crédits insuffisants. Veuillez recharger vos crédits pour utiliser la génération IA.

# mod.itrblueboost.generatingWait
source: Generating... This may take a few seconds.
fr_fr: Génération en cours... Cela peut prendre quelques secondes.

# mod.itrblueboost.connectionError
source: Connection error.
fr_fr: Erreur de connexion.

# mod.itrblueboost.anErrorOccurred
source: An error occurred.
fr_fr: Une erreur est survenue.

# mod.itrblueboost.pending
source: Pending
fr_fr: En attente

# mod.itrblueboost.accepted
source: Accepted
fr_fr: Accepté

# mod.itrblueboost.rejected
source: Rejected
fr_fr: Rejeté

# mod.itrblueboost.rejectFaq
source: Reject FAQ
fr_fr: Rejeter la FAQ

# mod.itrblueboost.rejectContent
source: Reject Content
fr_fr: Rejeter le contenu

# mod.itrblueboost.rejectImage
source: Reject Image
fr_fr: Rejeter l'image

# mod.itrblueboost.rejectionReason
source: Rejection reason
fr_fr: Raison du rejet

# mod.itrblueboost.enterReasonForRejection
source: Enter the reason for rejection...
fr_fr: Indiquez la raison du rejet...

# mod.itrblueboost.rejectionReasonSent
source: Rejection reason sent successfully.
fr_fr: Raison du rejet envoyée avec succès.

# mod.itrblueboost.accept
source: Accept
fr_fr: Accepter

# mod.itrblueboost.acceptAll
source: Accept all
fr_fr: Tout accepter

# mod.itrblueboost.rejectAll
source: Reject all
fr_fr: Tout rejeter

# mod.itrblueboost.deleteAll
source: Delete all
fr_fr: Tout supprimer

# mod.itrblueboost.acceptSelection
source: Accept selection
fr_fr: Accepter la sélection

# mod.itrblueboost.rejectSelection
source: Reject selection
fr_fr: Rejeter la sélection

# mod.itrblueboost.filterByStatus
source: Filter by status:
fr_fr: Filtrer par statut :

# mod.itrblueboost.itemsPerPage
source: Items per page:
fr_fr: Éléments par page :

# mod.itrblueboost.pagination
source: Page %current% of %total%
fr_fr: Page %current% sur %total%

# mod.itrblueboost.gridView
source: Grid view
fr_fr: Vue grille

# mod.itrblueboost.listView
source: List view
fr_fr: Vue liste

# mod.itrblueboost.viewDetails
source: View details
fr_fr: Voir les détails

# mod.itrblueboost.logNotFound
source: Log not found.
fr_fr: Log introuvable.

# mod.itrblueboost.allLogsCleared
source: All logs cleared.
fr_fr: Tous les logs supprimés.

# mod.itrblueboost.errorClearingLogs
source: Error clearing logs.
fr_fr: Erreur lors de la suppression des logs.

# mod.itrblueboost.logsOlderDeleted
source: Logs older than %d days deleted.
fr_fr: Logs de plus de %d jours supprimés.

# mod.itrblueboost.errorDeletingOldLogs
source: Error deleting old logs.
fr_fr: Erreur lors de la suppression des anciens logs.

# mod.itrblueboost.noApiLogs
source: No API logs found.
fr_fr: Aucun log API trouvé.

# mod.itrblueboost.clearAll
source: Clear all
fr_fr: Tout supprimer

# mod.itrblueboost.deleteOldLogs
source: Delete old logs
fr_fr: Supprimer les anciens logs

# mod.itrblueboost.deleteLogsConfirm
source: Are you sure you want to delete ALL logs?
fr_fr: Êtes-vous sûr de vouloir supprimer TOUS les logs ?

# mod.itrblueboost.deleteLogsOlderThan
source: Delete logs older than how many days?
fr_fr: Supprimer les logs de plus de combien de jours ?

# mod.itrblueboost.apiCall
source: API call
fr_fr: Appel API

# mod.itrblueboost.method
source: Method
fr_fr: Méthode

# mod.itrblueboost.duration
source: Duration
fr_fr: Durée

# mod.itrblueboost.context
source: Context
fr_fr: Contexte

# mod.itrblueboost.allContexts
source: All contexts
fr_fr: Tous les contextes

# mod.itrblueboost.start
source: Start
fr_fr: Début

# mod.itrblueboost.requestInfo
source: Request Info
fr_fr: Infos de la requête

# mod.itrblueboost.requestBody
source: Request Body
fr_fr: Corps de la requête

# mod.itrblueboost.requestHeaders
source: Request Headers
fr_fr: En-têtes de la requête

# mod.itrblueboost.responseBody
source: Response Body
fr_fr: Corps de la réponse

# mod.itrblueboost.noResponseBody
source: No response body
fr_fr: Pas de corps de réponse

# mod.itrblueboost.backToLogs
source: Back to logs
fr_fr: Retour aux logs

# mod.itrblueboost.backToProduct
source: Back to product
fr_fr: Retour au produit

# mod.itrblueboost.backToCategory
source: Back to category
fr_fr: Retour à la catégorie

# mod.itrblueboost.save
source: Save
fr_fr: Enregistrer

# mod.itrblueboost.manual
source: Manual
fr_fr: Manuel
